export interface Testimonial {
  name: string;
  role: string;
  company: string;
  text: string[];
}

export const testimonials: Testimonial[] = [
  {
    name: 'Максим Бодриков',
    role: 'СEO',
    company: 'AKPublish ltd',
    text: [
      '«Ирина присоединилась к команде для работы над интерфейсом игры Aliens, Zombies, Robots и реализовала именно то, что нам было нужно.',
      'Вайрфреймы, ключевые экраны, поп-апы и иконки под её авторством сложились в единую систему с мощным визуальным стилем, идеально передающим атмосферу проекта.',
      'Созданные и доработанные ею AI-арты уже интегрированы в игру, и мы с нетерпением ждем возможности задействовать их в промо-кампаниях по завершении бета-теста.»',
    ],
  },
  {
    name: 'Андрей Петров',
    role: 'Product Owner',
    company: 'Integrix',
    text: [
      'Выдержка из итогового отчета по исследованию геймифицированного интерфейса (Интерфейс В), созданного мной для отработки гипотезы:',
      '«Хотя Интерфейс В потерпел закономерное поражение из-за повышенного визуального шума, его функциональное ядро (система быстрых фильтров, агрегированные числовые индикаторы статусов, готовые шаблоны реестров) представляет собой колоссальную ценность.',
      'Рекомендуется интегрировать эти инструменты в спокойную архитектуру Интерфейса А, используя скрытые выпадающие панели или шторки.»',
    ],
  },
  {
    name: 'Кира Сайко',
    role: 'Senior UX designer',
    company: 'ex PlayStation',
    text: [
      '«Хочу порекомендовать Ирину, она очень работоспособная и вдумчивая, тщательно подходит к дизайн процессу.',
      'С ней легко и приятно работать.»',
    ],
  },
  {
    name: 'Amurobird',
    role: 'Owner',
    company: 'Far Manor',
    text: [
      '«Ирина сделала редизайн ключевых экранов игры: создание персонажей, бой, профиль героя, подготовка к свиданию. Игре требовалось переосмысление во многих аспектах, поэтому могу отметить, что она внимательно разбиралась в механика и ориентировалась на удобство для игрока.',
      'За время нашего сотрудничества игра обрела новую эстетичную дизайн-систему и стала заметно понятнее для пользователей.»',
    ],
  },
];
